In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score


df=pd.read_csv("DataSets\salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
inputs=df.drop(["salary_more_then_100k"], axis=1)
target=df["salary_more_then_100k"]
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [4]:
df.columns

Index(['company', 'job', 'degree', 'salary_more_then_100k'], dtype='object')

In [5]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [6]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()
inputs.drop(inputs[["company", "job", "degree"]], axis=1)
inputs["company"]=le_company.fit_transform(df["company"])
inputs["job"]=le_job.fit_transform(df["job"])
inputs["degree"]=le_degree.fit_transform(df["degree"])

In [7]:
X_train, X_test, y_train, y_test=train_test_split(inputs, target, test_size=0.3, random_state=100)
model=DecisionTreeClassifier(criterion="entropy", min_samples_leaf=9, max_depth=4, random_state=100)
model.fit(X_train, y_train)
model.score(X_test, y_test)

0.8

In [8]:
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1